Revit 2027 API
RevitLinkType.HasSaveablePositions Method
 Determines whether the link has changes to shared positioning that could be saved.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasSaveablePositions()
Public Function HasSaveablePositions As Boolean
public:
bool HasSaveablePositions()
member HasSaveablePositions : unit -> bool
Return Value
Boolean
 True if the link has shared positioning changes which can be saved. False if there are no changes to shared coordinates, or if the changes cannot be saved.
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace